[
  {
    "playerId": 170531,
    "summary": "Cooper Flagg is a versatile forward with a well-rounded game, showcasing his ability to impact the contest in multiple ways. He has a strong work ethic, which translates to consistent production on the court. As he continues to develop, I envision him carving out a role as a high-energy wing player who can contribute to an NBA team's success through his defensive tenacity and all-around scoring capabilities."
  },
  {
    "playerId": 161608,
    "summary": "Dylan Harper is a dynamic scorer with a strong all-around game. He excels as a volume shooter, capable of getting buckets from anywhere on the court, but also shows a willingness to facilitate for his teammates when needed. His impressive 2025 stats suggest he could be a valuable swingman in the NBA, potentially carving out a niche as a scoring wing who can also contribute to the team's ball movement and playmaking efforts."
  },
  {
    "playerId": 161710,
    "summary": "Ace Bailey is a versatile forward with a strong two-way profile. He demonstrates a comfortable ability to score from various spots on the court, showcasing a reliable mid-range game and decent touch around the rim. What's particularly impressive is his willingness to contribute in other areas, as evident by his strong rebounding and playmaking numbers. Overall, Bailey's all-around skills suggest he could thrive as a hybrid forward in an NBA role similar to a small-ball four or stretch-four, where he can utilize his size, athleticism, and shooting ability to create mismatches and exploit defensive vulnerabilities."
  },
  {
    "playerId": 181834,
    "summary": "VJ Edgecombe is a dynamic, undersized wing who excels at making plays off the dribble and creating opportunities for himself and his teammates. He thrives in transition, where he can use his quickness and agility to beat opponents to the rim or pull up for mid-range jumpers. While he may struggle defending bigger opponents in isolation situations, his overall athleticism and motor make him a valuable asset as a secondary playmaker off the bench in the NBA."
  },
  {
    "playerId": 140378,
    "summary": "Kasparas Jakucionis is a versatile small forward with a well-rounded skill set. He excels at scoring from mid-range, using his footwork to create space and his shooting form to convert efficiently. While he's still developing his playmaking abilities, his 6'6\" frame and athleticism allow him to be effective on the glass, where he can capitalize on second-chance opportunities."
  },
  {
    "playerId": 161852,
    "summary": "Kon Knueppel is a versatile forward who excels at creating for himself and others. He has a well-rounded game, showcasing his ability to score from various spots on the court, rebound effectively, and distribute the ball with precision. As he continues to develop, I envision him playing a key role off the bench in the NBA, using his all-around skills to provide a spark and maintain a high level of intensity throughout the game."
  },
  {
    "playerId": 164614,
    "summary": "Khaman Maluach is a dominant force on the glass, utilizing his exceptional size and length to control rebounds on both ends of the court. His presence in the paint allows him to assert himself physically and capitalize on second-chance opportunities, showcasing his impressive finishing ability around the rim. While he may not be a natural playmaker or scorer, Maluach's rebounding prowess and defensive tenacity make him an intriguing prospect to project as a key contributor off the bench or in a backup role in the NBA."
  },
  {
    "playerId": 138145,
    "summary": "Egor Demin is a skilled combo forward with a well-rounded game, showcasing versatility on both ends of the court. His ability to facilitate and create for teammates, demonstrated by his impressive assist numbers, suggests he has a strong understanding of team concepts. While he may not be a dominant scorer, his high basketball IQ and playmaking skills make him an ideal secondary playmaker, capable of fitting into various roles in the NBA, potentially as a hybrid forward or stretch four."
  },
  {
    "playerId": 183971,
    "summary": "Here is a concise scouting summary of Jeremiah Fears:\n\nJeremiah Fears is an intriguing prospect with a well-rounded game that showcases his exceptional passing ability and scoring potential. He excels in transition, where he can use his quickness and agility to create opportunities for himself and teammates. While he may struggle at times when forced to operate in half-court settings, Fears' unique combination of playmaking skills and shooting range makes him an attractive prospect for teams looking for a sparkplug off the bench or potential starter in the NBA."
  },
  {
    "playerId": 158352,
    "summary": "Here is a concise scouting summary of Derik Queen:\n\nDerik Queen is a physical presence on the court, utilizing his size and strength to dominate the paint and rebound with aplomb. He shows a knack for being in the right place at the right time, snatching up loose balls and putting back put-backs with ease. While he may not have a flashy scoring arsenal, Queen's sheer athleticism and tenacity on the glass make him an asset on both ends of the floor, potentially fitting into a role as a stretch-five or energy big in the NBA."
  },
  {
    "playerId": 162155,
    "summary": "Tre Johnson is a dynamic scorer with a well-rounded skillset. He excels in creating his own opportunities, showcasing an impressive ability to get buckets off the dribble and spot-up shots. His versatility extends beyond scoring, as he demonstrates a keen sense of court awareness, dishing out solid assists and even contributing on the glass.\n\nIn the NBA, Johnson's aggressive playing style and knack for creating separation could make him a valuable asset off the bench or in a sixth-man role, allowing teams to capitalize on his explosive scoring ability."
  },
  {
    "playerId": 182192,
    "summary": "Joan Beringer is a physical specimen with a promising upside. His 6'11\" frame and 236-pound stature allow him to dominate the paint, where he excels at cleaning up rebounds and scoring with his back to the basket. While he's still developing his overall game, his athleticism and positioning give him an edge on both ends of the court, suggesting a potential role as a high-energy big man off the bench in the NBA."
  },
  {
    "playerId": 141122,
    "summary": "Nolan Traore is a dynamic young shooting guard with a well-rounded skill set. He excels at creating scoring opportunities for himself and others, consistently displaying excellent court vision and playmaking ability. His athleticism and defensive versatility allow him to thrive in a variety of roles, making him an intriguing prospect who could potentially carve out a niche as a scoring sparkplug off the bench or a backup combo guard in the NBA."
  },
  {
    "playerId": 159895,
    "summary": "Liam McNeeley is a versatile forward who excels as a primary scorer and playmaker. He has a strong sense of court vision, often finding open teammates for easy baskets while also capable of taking over games himself with his smooth shooting stroke. With his ability to rebound at an impressive rate, especially in crunch time, he has the potential to be a valuable rotational piece off the bench or even a starter in the NBA."
  },
  {
    "playerId": 141473,
    "summary": "Hugo Gonzalez is a versatile 6'7\" wing prospect from Real Madrid, showcasing a well-rounded skillset. He displays a keen ability to impact the game on multiple fronts, often making smart decisions as a playmaker and using his length to harass opponents on defense. While he may not dominate the box score in any one category, Gonzalez's all-around skills make him an intriguing prospect who could carve out a niche role in the NBA as a hybrid wing player, capable of contributing to both ends of the floor."
  },
  {
    "playerId": 153927,
    "summary": "Danny Wolf is a physically imposing 7'0\" big man who excels in the paint with his strong rebounding and shot-blocking abilities. He has a well-rounded game, capable of scoring efficiently and making smart decisions on the court. While he may not be a dominant scorer, Wolf's ability to control the glass and protect the rim makes him an attractive option for teams looking for a physical presence in the post."
  },
  {
    "playerId": 162876,
    "summary": "Ben Saraf is a promising young guard who has shown flashes of brilliance on the court. His ability to rack up impressive assist totals, particularly in games where he's scoring well, suggests that he's a natural playmaker with excellent vision. However, his scoring output appears to be more sporadic, and he may struggle to find consistency as a primary scorer at the next level - suggesting he could thrive as a secondary playmaker or spot-up shooter in an NBA system."
  },
  {
    "playerId": 171552,
    "summary": "Collin Murray-Boyles is a physical, old-school post player who excels in the paint. He thrives when given a low-post presence, using his strength and footwork to overpower opponents for baskets and rebounds. While he may not be a stretch-five or playmaker at this level, he could carve out a niche as a solid, interior-minded big man in the NBA, potentially providing a reliable scoring punch off the bench or in a starting role."
  },
  {
    "playerId": 141110,
    "summary": "Noa Essengue showcases a promising blend of size, athleticism, and developing skillset. As a 6'10\" big man, he has a strong physical presence that allows him to control the paint and grab rebounds with ease. While he still needs to refine his post game and shooting range, his impressive athleticism and playmaking ability make him an intriguing prospect who could thrive as a hybrid power forward/center in the NBA."
  },
  {
    "playerId": 161919,
    "summary": "Will Riley is a skilled combo forward with a well-rounded game, capable of impacting the contest on multiple fronts. He showcases a strong understanding of team basketball, consistently making smart decisions to facilitate his teammates' scoring opportunities while also being an efficient scorer himself. As he continues to develop his skills, I envision him becoming a versatile role player in the NBA, potentially serving as a reliable third or fourth option off the bench."
  },
  {
    "playerId": 171542,
    "summary": "Asa Newell is a physically imposing big man with a well-rounded skillset, capable of impacting the game on multiple fronts. He shows a knack for scoring from various areas on the court, including post-ups, mid-range jumpers, and put-backs, while also contributing to the glass and setting up teammates for easy baskets. As he continues to develop his overall game, he has the potential to be a valuable rotational player in the NBA, potentially playing a combo forward role that allows him to utilize his size, strength, and versatility to make an impact on both ends of the floor."
  },
  {
    "playerId": 171436,
    "summary": "Here's a concise scouting summary of Drake Powell:\n\nDrake Powell is a versatile wing player with a well-rounded game. He excels at scoring from mid-range, showcasing a reliable jump shot and the ability to create for himself off the dribble. Powell's all-around production suggests he could potentially play a role as a high-energy swingman in the NBA, capable of providing instant offense and defense off the bench."
  },
  {
    "playerId": 169666,
    "summary": "Here is a concise scouting summary of Carter Bryant:\n\nCarter Bryant is a versatile, physical player who excels as a rebounding forward. He consistently attacks the glass with purpose, using his strength and length to secure rebounds in traffic. While he's still developing his outside shooting range, Bryant shows promise as a low-post scorer and defender, making him an intriguing prospect for the NBA."
  },
  {
    "playerId": 154835,
    "summary": "Here is a concise scouting summary of Thomas Sorber:\n\nThomas Sorber, a 6'10\" power forward from Georgetown, showcases his versatility on the court. He excels in the paint, utilizing his size and strength to grab rebounds and finish with authority. However, he also possesses a solid mid-range shooting touch, which allows him to stretch defenses and create opportunities for himself and teammates.\n\nSorber's performance is often characterized by a mix of physicality and finesse, making him an intriguing prospect in the NBA. His rebounding prowess and ability to score from both the post and perimeter suggest he could thrive as a secondary scorer or stretch-four, potentially bringing a unique dimension to an NBA offense."
  },
  {
    "playerId": 172132,
    "summary": "Adou Thiero is a physically impressive forward with a well-rounded game. He excels at using his size and strength to overpower opponents on the glass, with a high motor that allows him to grab rebounds in traffic. While he's not a flashy scorer, Thiero has shown an ability to score efficiently around the rim and from mid-range, making him a threat in pick-and-pop situations. As he develops his outside shooting and playmaking abilities, he could project as a versatile power forward who can play both inside and out at the next level."
  },
  {
    "playerId": 159033,
    "summary": "Alex Condon is a developing big man with a strong foundation in rebounding and defense. He displays a physicality that allows him to battle for position on the glass, often emerging with impressive totals. While his scoring efficiency may not be elite, he has shown an ability to impact the game in various ways, which could make him a valuable asset off the bench or as a rotational big man in the NBA."
  },
  {
    "playerId": 130696,
    "summary": "Noah Penda is a physical and athletic big man who excels in transition opportunities, showcasing his ability to finish strong at the rim and grab rebounds. He also displays solid playmaking skills, often setting up teammates for easy baskets. While he may struggle against stronger post defenders, Penda's versatility and energy could make him a valuable asset off the bench or as a role-playing starter in the NBA, particularly on teams that value his athleticism and defensive potential."
  },
  {
    "playerId": 161180,
    "summary": "Rasheer Fleming is a physical presence on the court, using his size and strength to overpower opponents in the paint. His best work comes when he's able to establish himself near the basket, where he can finish through contact or draw fouls. While he may not be a stretch-five prospect, Fleming's interior prowess makes him an attractive option for teams looking to add some muscle to their frontcourt rotation."
  },
  {
    "playerId": 144830,
    "summary": "Alex Karaban is a versatile forward who excels at using his size and athleticism to impact the game on multiple fronts. He shows a strong ability to score efficiently from both inside and outside, but also has a knack for creating for himself and others with clever ball movement and anticipation. As he continues to develop his all-around skills, Karaban may find a role as a high-energy swingman in the NBA, capable of providing scoring punch off the bench or contributing to a team's defensive efforts."
  },
  {
    "playerId": 161742,
    "summary": "Jase Richardson is a high-energy, attack-minded shooting guard with a strong all-around game. He thrives in transition, where his quickness and explosiveness allow him to finish above the rim and draw fouls. As he continues to develop his outside shot, he may be able to create more space for himself and others on the court, potentially becoming a valuable scoring sparkplug off the bench or even a starter at the NBA level."
  },
  {
    "playerId": 124543,
    "summary": "Ryan Kalkbrenner is a dominant post presence with a rare combination of size, strength, and mobility. He excels in physical matchups, using his 7'2\" frame to overpower opponents and control the paint. While he may not be as polished on the perimeter, his ability to stretch the defense with mid-range jumpers and finish at the rim makes him an attractive option for teams looking to add a physical presence in the low post."
  },
  {
    "playerId": 141197,
    "summary": "Michael Ruzic presents a promising package as a young big man. He showcases a solid, physical style of play, using his length and strength to secure rebounds and create opportunities for himself and teammates. While he may not have a flashy scoring repertoire just yet, Ruzic's all-around profile suggests he could develop into a reliable contributor off the bench or in a supporting role at the NBA level."
  },
  {
    "playerId": 159744,
    "summary": "Ian Jackson is a dynamic shooting guard who thrives off the ball, showcasing a silky-smooth jump shot and aggressive scoring mentality. He excels when creating his own opportunities, using his quickness and agility to get past defenders and finish at the rim. While he may not dominate on the glass or rack up assists, Jackson's ability to score from anywhere on the court makes him a valuable asset off the bench in the NBA."
  },
  {
    "playerId": 136466,
    "summary": "Sergio De Larrea is a promising young prospect who showcases his versatility on the court. He has a well-rounded game, capable of contributing on both ends with his strong rebounding and playmaking abilities. While still developing his scoring touch, he demonstrates an understanding of team basketball and can thrive as a supporting piece in the NBA, potentially carving out a role as a high-energy swingman or defensive specialist."
  },
  {
    "playerId": 123733,
    "summary": "Maxime Raynaud is a physical specimen with impressive size and length, utilizing his 7'1\" frame to control the paint and rebound at an elite level. His game is built around post-up opportunities, where he showcases soft touch and an array of counter-moves to score efficiently. While still developing his three-point range, Raynaud's versatility and defensive presence make him a promising NBA prospect who could thrive as a stretch-five or defensive anchor in the right system."
  },
  {
    "playerId": 129665,
    "summary": "Alex Toohey is a 6'8\" Australian big man who showcases a well-rounded skillset. He excels at scoring efficiently, particularly around the rim, where his size and athleticism allow him to finish with authority. As he continues to develop, he may thrive as a hybrid power forward/center, capable of playing both inside and outside, making him an intriguing prospect for teams seeking a versatile big man."
  },
  {
    "playerId": 159898,
    "summary": "Boogie Fland is a dynamic playmaker with exceptional vision and court awareness. He thrives in pick-and-roll situations, using his quickness and agility to create opportunities for himself and teammates. As he continues to develop his scoring repertoire, he may shift from a primary playmaking role to a more versatile off-guard who can create for others while also contributing as a threat from beyond the arc."
  },
  {
    "playerId": 155302,
    "summary": "Miles Byrd is a versatile small forward who excels on both ends of the court. His well-rounded game allows him to impact the contest in various ways, whether it's scoring from mid-range, rebounding with tenacity, or making plays as a playmaker. As he continues to develop his skills and physicality, I envision Byrd carving out a niche as a reliable role player in the NBA, capable of contributing to a team's winning efforts while also providing insurance on the perimeter."
  },
  {
    "playerId": 157395,
    "summary": "Chaz Lanier is a dynamic scorer with a strong sense of urgency on the court. He excels in isolation situations, where he can use his quick first step to get past defenders and finish at the rim. His ability to score from anywhere on the court makes him a threat off the dribble or off screens, but he may struggle when forced to play more methodically, relying on teammates for scoring opportunities. In the NBA, Lanier could be an effective sixth man or role player, providing a spark off the bench with his athleticism and scoring prowess."
  },
  {
    "playerId": 129693,
    "summary": "Tyrese Proctor is a versatile combo guard with a strong all-around game. He excels at scoring efficiently, using his quickness and footwork to create opportunities off the dribble or in transition. While he's not a natural playmaker, he shows a willingness to set up teammates and make smart decisions when possession is paramount.\n\nIn the NBA, Proctor could carve out a role as a high-energy backup guard, bringing a spark to the second unit with his athleticism and defensive tenacity. His ability to score and create for others will allow him to contribute offensively, while his work ethic and competitive drive will make him a valuable asset on both ends of the court."
  },
  {
    "playerId": 139482,
    "summary": "Johni Broome is a physical force on the court, utilizing his size and strength to overpower opponents. He excels as a post player, using his footwork and athleticism to score in the paint and gather rebounds. While he may not be a polished perimeter shooter, his ability to finish at the rim and crash the boards makes him an asset in the NBA's modern pace-and-space era, potentially playing a key role as a reserve big man or hybrid forward."
  },
  {
    "playerId": 164509,
    "summary": "Dink Pate is a high-energy, athletic wing who excels at attacking the basket and making plays off the dribble. He has a knack for creating opportunities for himself and his teammates, often using his quickness and agility to get around defenders. While he still needs to refine his shooting consistency, Pate's all-around skills make him an intriguing prospect with potential to contribute as a role player in the NBA."
  },
  {
    "playerId": 155317,
    "summary": "Darrion Williams is a physical and versatile wing player who excels at attacking the basket and creating opportunities for himself and his teammates. His aggressive mentality allows him to thrive in transition, where he can use his quickness and strength to finish at the rim or draw contact and get to the free-throw line. While he may struggle with consistency from beyond the arc, Williams' ability to impact the game on both ends of the floor makes him a promising NBA prospect who could carve out a role as a high-energy scorer off the bench or in a hybrid forward position."
  },
  {
    "playerId": 99451,
    "summary": "Eric Dixon is a physical force on the court, utilizing his 6'8\" frame to overpower opponents in the paint and on the glass. He shows a strong inclination towards scoring, often relying on his athleticism and footwork to create opportunities near the basket. While he may not be a natural playmaker, Dixon's versatility makes him an attractive prospect as a stretch-five or power forward, capable of making an impact on both ends of the floor."
  },
  {
    "playerId": 149244,
    "summary": "Here is a concise scouting summary of Kam Jones:\n\nKam Jones is an exceptional combo guard with a unique blend of scoring, playmaking, and defensive prowess. He excels at creating for himself and others, often using his quickness and agility to get into the paint or pull up from mid-range. As he continues to develop, Jones's ability to make shots off the dribble and his excellent court vision will enable him to thrive as a primary ball-handler in the NBA."
  },
  {
    "playerId": 139181,
    "summary": "Sion James is a high-motor, versatile wing prospect who excels at both ends of the floor. He demonstrates a strong understanding of his limitations as an undersized big man, using his quickness and agility to compensate for size advantages. With his ability to score efficiently from all levels, grab rebounds, and facilitate the offense, James projects as a valuable role player in the NBA, potentially serving as a hybrid forward or energy sparkplug off the bench."
  },
  {
    "playerId": 148503,
    "summary": "Here's a concise scouting summary of Johann Grunloh:\n\nJohann Grunloh is an intriguing big man prospect with a strong foundation in defense and rebounding. His physical presence allows him to anchor the paint and secure rebounds, showcasing his ability to protect the rim and control the boards. While he may not be a dominant scorer at this stage, his low-post footwork and finishing skills suggest potential for growth and development as a reliable contributor on both ends of the floor in an NBA role."
  },
  {
    "playerId": 170920,
    "summary": "Joseph Tugler is a physical forward with a rugged, blue-collar playing style. He excels in the paint, using his strength and positioning to secure rebounds and protect the rim. While he may not be a flashy scorer, Tugler's ability to produce in the paint and control the boards could make him a valuable asset off the bench or as a starter in the right system."
  },
  {
    "playerId": 144537,
    "summary": "Here is a concise scouting summary of Nique Clifford:\n\nNique Clifford is a versatile wing player who excels at reading defenses and making smart decisions. He has a keen ability to find seams in the opposition's defense, which allows him to score efficiently from mid-range and create opportunities for teammates. While he may not be a dominant rebounder or shot blocker, Clifford's all-around skills make him an attractive prospect as a role player in the NBA, potentially fitting into a supporting cast alongside a more ball-dominant guard."
  },
  {
    "playerId": 161559,
    "summary": "Isaiah Evans is a versatile, athletic scoring guard with a knack for creating his own opportunities. He excels in transition, using his quickness and agility to beat defenders and finish at the rim. While he still develops his off-ball skills, Evans' ability to score from anywhere on the court and make plays in isolation scenarios will translate well to the NBA, where he could thrive as a scoring combo guard or even a primary playmaker."
  },
  {
    "playerId": 164825,
    "summary": "Rocco Zikarsky is a towering presence on the court, showcasing his dominance in the paint with impressive rebounding and scoring numbers. His 7'3\" frame allows him to control the boards with ease, and he has demonstrated an ability to capitalize on second-chance opportunities. While still developing his overall game, Zikarsky's physicality and athleticism suggest a promising future as a defensive anchor and rebounding specialist in the NBA."
  },
  {
    "playerId": 159976,
    "summary": "Bogoljub Markovic is a promising young center with a strong all-around game. He showcases a unique combination of scoring ability, rebounding prowess, and playmaking skills, often serving as a facilitator in Mega Superbet's offense. While he may not dominate the box score on every occasion, Markovic's versatility and positional awareness suggest he could thrive as a mid-range big man in the NBA, potentially providing a boost to his team's attack while also defending the paint effectively."
  },
  {
    "playerId": 172020,
    "summary": "Mouhamed Faye is a physically impressive post player who excels at cleaning up around the basket and using his size to control the paint. He displays a strong work ethic, consistently putting in an effort on the glass and showing the ability to secure rebounds in traffic. While he may not have a polished offensive game, his physicality and rebounding prowess suggest he could carve out a role as a high-energy big man in the NBA, potentially serving as a defensive anchor or second-unit sparkplug."
  },
  {
    "playerId": 179629,
    "summary": "Cedric Coward is a versatile swingman with a well-rounded skill set, capable of scoring, rebounding, and facilitating at an impressive level. His ability to adapt his game to suit the situation, whether it's dominating in the paint or stretching the defense from beyond the arc, makes him a threat on both ends of the court. As he transitions to the NBA, Coward may find himself playing off the ball as a secondary scorer and rebounder, using his high motor and positional versatility to make an impact off the bench."
  },
  {
    "playerId": 193314,
    "summary": "Yaxel Lendeborg is a physically gifted big man with a well-rounded game. He excels at doing all things, from rebounding to facilitating, often taking on a \"point-forward\" role in UAB's offense. While he may not dominate the scoreboard, his exceptional size and length allow him to control the paint and make plays that don't always show up in the box score."
  },
  {
    "playerId": 118028,
    "summary": "Zvonimir Ivisic is a towering post player with a well-rounded skill set, capable of dominating stretches of games with his physical presence and smooth shooting touch. He excels in the paint, using his length and strength to assert himself on the glass and protect the rim, but also shows flashes of range out to 15 feet, making him a valuable asset in both half-court sets and transition opportunities. As he continues to develop his overall game, Ivisic has the potential to thrive as a stretch five or power forward in the NBA, providing a low-post scoring punch and defensive presence for any team."
  },
  {
    "playerId": 164505,
    "summary": "JT Toppin is a dynamic, physical forward with a well-rounded game. He excels in high-post situations, where his size, strength, and footwork allow him to dominate the paint and finish at the rim. While he can struggle shooting from beyond 15 feet, his ability to score in traffic and rebound effectively makes him a valuable asset on both ends of the court."
  },
  {
    "playerId": 140078,
    "summary": "Koby Brea is a dynamic wing player with a well-rounded skillset, capable of impacting the game on both ends of the floor. He showcases impressive scoring ability when attacking the basket or stretching the defense with his three-point range. However, his inconsistent rebounding and occasional struggles to create for teammates suggest he may need to develop his playmaking skills further to unlock his full potential in the NBA, potentially settling into a role as a high-scoring swingman off the bench."
  },
  {
    "playerId": 167838,
    "summary": "Malique Lewis is a raw but intriguing prospect with a unique blend of size, athleticism, and developing skills. He operates primarily as a face-up scorer, using his length to create space and exploit mismatches in the paint. While still refining his overall game, Lewis has shown flashes of brilliance on both ends of the floor, particularly when he's able to assert himself and play with a high level of intensity."
  },
  {
    "playerId": 142035,
    "summary": "Hunter Sallis is a high-energy wing prospect who excels in transition and attacking the basket. He shows a strong ability to score from mid-range and finish above the rim, often relying on his quickness and leaping ability to create separation. While he may struggle to consistently create for himself or others off the dribble, his athleticism and defensive tenacity suggest he could thrive as a primary scorer and rebounder in the NBA, potentially playing a role similar to a modern-day wing specialist like Danny Green."
  }
]